#+TILE: Tenzor - Character Sheet

* Constants
  #+NAME: define-constants-with-src-block
  #+BEGIN_SRC elisp :var table=stats :colnames yes :results output drawer :cache yes :lang elisp
    (dnd-output-ability-constants table)
  #+END_SRC

  #+RESULTS[9c27f200ccc7082ca981f8b7262c1ac0e62f6846]: define-constants-with-src-block
  :results:
  #+CONSTANTS: STR=10
  #+CONSTANTS: DEX=14
  #+CONSTANTS: CON=14
  #+CONSTANTS: INT=12
  #+CONSTANTS: WIS=8
  #+CONSTANTS: CHA=17
  #+CONSTANTS: PROF=2
  #+CONSTANTS: SCA=13
  #+CONSTANTS: SAM=5
  :end:
  
* Traits
  | Level | Race       | Subrace | Class | Subclass | Age | Alignment    | Size             |
  |-------+------------+---------+-------+----------+-----+--------------+------------------|
  |     2 | Changeling |         | Bard  |          |  37 | Chaotic Good | Medium(155) 5'9" |

* Stats  
  | Speed | Hit Points | AC | Saves | Inspiration | Hit Dice |
  |-------+------------+----+-------+-------------+----------|
  |    30 | 17/17      | 15 |       |             | (1d8) 5  |
  
* Abilities and Skills
  #+name: stats
  | Ability | Score | Mod | PB | Roll           | Skill                 |
  |---------+-------+-----+----+----------------+-----------------------|
  | STR     |    10 |   0 |    | 1d20 + 0       | Saving Throw          |
  |         |       |     |    | 1d20 + 0       | Athletics             |
  |---------+-------+-----+----+----------------+-----------------------|
  | DEX     |    14 |   2 | X  | 1d20 + 4       | Saving Throw          |
  |         |       |     |    | 1d20 + 2       | Acrobatics            |
  |         |       |     |    | 1d20 + 2       | Sleight of Hand       |
  |         |       |     | X  | 1d20 + 4       | Stealth               |
  |---------+-------+-----+----+----------------+-----------------------|
  | CON     |    14 |   2 |    | 1d20 + 2       | Saving Throw          |
  |---------+-------+-----+----+----------------+-----------------------|
  | INT     |    12 |   1 |    | 1d20 + 1       | Saving Throw          |
  |         |       |     |    | 1d20 + 1       | Arcana                |
  |         |       |     |    | 1d20 + 1       | History               |
  |         |       |     | X  | 1d20 + 3       | Investigation         |
  |         |       |     |    | 1d20 + 1       | Nature                |
  |         |       |     |    | 1d20 + 1       | Religion              |
  |---------+-------+-----+----+----------------+-----------------------|
  | WIS     |     8 |  -1 |    | 1d20 + -1      | Saving Throw          |
  |         |       |     |    | 1d20 + -1      | Animal Handling       |
  |         |       |     | X  | 1d20 + 1       | Insight               |
  |         |       |     |    | 1d20 + -1      | Medicine              |
  |         |       |     | X  | 1d20 + 1       | Perception            |
  |         |       |     |    | 1d20 + -1      | Survival              |
  |---------+-------+-----+----+----------------+-----------------------|
  | CHA     |    17 |   3 | X  | 1d20 + 5       | Saving Throw          |
  |         |       |     | X  | 1d20 + 5       | Deception             |
  |         |       |     |    | 1d20 + 3       | Intimidation          |
  |         |       |     |    | 1d20 + 3       | Performance           |
  |         |       |     | X  | 1d20 + 5       | Persuasion            |
  |---------+-------+-----+----+----------------+-----------------------|
  | PROF    |     2 |     |    |                |                       |
  | SCA     |    13 |     |    | 8 + PROF + CHA | SPELL CASTING ABILITY |
  | SAM     |     5 |     |    | PROF + CHA     | SPELL ATT MOD         |
  #+TBLFM: @2$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @4$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @8$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @9$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @15$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @21$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @2$5..@3$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @2$1))))))
  #+TBLFM: @4$5..@7$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @4$1))))))
  #+TBLFM: @8$5..@8$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @8$1))))))
  #+TBLFM: @9$5..@14$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @9$1))))))
  #+TBLFM: @15$5..@20$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @15$1))))))
  #+TBLFM: @21$5..@25$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @21$1))))))
  
* Attacks
  #+NAME: attacks
  | Weapon      | Ability | Prof | Type     | Die | Mod To Hit | Roll    |
  |-------------+---------+------+----------+-----+------------+---------|
  | Short Sword | STR     | X    | Piercing | 1d6 |          2 | 1d6 + 0 |
  | Short Sword | DEX     | X    | Piercing | 1d6 |          4 | 1d6 + 2 |
  | Dagger      | DEX     | X    | Piercing | 1d4 |          4 | 1d4 + 2 |
  #+TBLFM: $6='(+ (if (string= $3 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant $2))))
  #+TBLFM: $7='(concat $5 " + " (number-to-string (calc-dnd-mod (string-to-number (org-table-get-constant $2)))))
 
* Proficiencies
  | Languages  | Tools | Instruments | Kits     | Armor | Weapons        |
  |------------+-------+-------------+----------+-------+----------------|
  | Common     |       | Piccolo     | Disguise | Light | Simple         |
  | Elvish     |       | Steel Drum  | Forgery  |       | Hand Crossbows |
  | Primordial |       | Guitar      |          |       | Long-swords    |
  |            |       |             |          |       | Rapiers        |
  |            |       |             |          |       | Short-swords   |

* Equipment
  | Name                        | Quantity | Cost (gp) | Weight (lbs) | Total Weight (lbs) | Total Cost (gp) |
  |-----------------------------+----------+-----------+--------------+--------------------+-----------------|
  | Diplomats Pack              |        1 |        45 |           13 |                 13 |              45 |
  | Leather Armor (11 + DEX)    |        1 |         0 |            3 |                  3 |               0 |
  | Steel Drum (Shield (+2 AC)) |        1 |        25 |            5 |                  5 |              25 |
  | Fine Clothes                |        1 |         0 |              |                  0 |               0 |
  | Disguise                    |        1 |         0 |              |                  0 |               0 |
  | Signet Ring of a duke       |        1 |         0 |              |                  0 |               0 |
  | Dagger                      |        1 |         5 |              |                  0 |               5 |
  |-----------------------------+----------+-----------+--------------+--------------------+-----------------|
  | Carry Capacity              |          |           |              |                  0 |               0 |
  #+TBLFM: $5=($2 * $4)
  #+TBLFM: $6=($2 * $3)
  #+TBLFM: @22$5=vsum(@2$5..@22$5)
  #+TBLFM: @22$6=vsum(@2$6..@21$6)
  #+TBLFM: @22$2=($STR * 10)

** Diplomats Pack
   - a chest
   - 2 cases for maps and Scrolls
   - a set of Fine clothes
   - a bottle of ink
   - an Ink pen
   - a lamp
   - 2 flasks of oil
   - 5 sheets of paper
   - a vial of Perfume
   - Sealing wax
   - soap.

** Money
   | Copper | Silver | Electrum | Gold | Platinum | Total (Gold) |
   |--------+--------+----------+------+----------+--------------|
   |      0 |      0 |        0 |   25 |        0 |            0 |
   #+TBLFM: $6=(($1 / 100) + ($2 / 10) + ($3 / 2) + $4 + ($5 * 10)) 
